[
  {
    "ref": "Romans 12:1-2",
    "translation": "KJV",
    "passage": "I beseech you therefore, brethren, by the mercies of God, that ye present your bodies a living sacrifice, holy, acceptable unto God, which is your reasonable service. And be not conformed to this world: but be ye transformed by the renewing of your mind, that ye may prove what is that good , and acceptable, and perfect, will of God.",
    "topic": "holy_surrender",
    "moral": "Worship is whole-life surrender. Renewed minds resist cultural pressure and discern God’s will.",
    "reflectionQ": "Where are you conforming to pressure instead of transforming by Scripture?",
    "challenge": "Schedule a 20-minute ‘Romans 12 altar time’ this week: confess, surrender, and write one renewed thought to practice.",
    "crossRefs": ["Luke 9:23", "Ephesians 4:23"],
    "length": "multi"
  },
  {
    "ref": "Mark 8:34-35",
    "translation": "KJV",
    "passage": "And when he had called the people unto him with his disciples also, he said unto them, whosoever will come to me, let him deny himself, and take up his cross, and follow me. For whosoever will save his life shall lose it; but whosoever shall lose his life for my sake and gospel's, the same shall save it.",
    "topic": "discipleship_cost",
    "moral": "Following Jesus means trading self-rule for His rule. Losing the lesser life finds the greater.",
    "reflectionQ": "What comfort or reputation are you protecting that keeps you from obedience?",
    "challenge": "Choose one costly obedience today and do it without posting about it.",
    "crossRefs": ["Luke 14:27", "Galatians 2:20"],
    "length": "multi"
  },
  {
    "ref": "1 Corinthians 6:18-20",
    "translation": "KJV",
    "passage": "Flee fornication. Every sin that a man doeth is without the body; but he that committeth fornication sinneth against his body. What? Know ye not your body is the temple of the Holy Ghost which is in you, which ye have God, and ye are not your own? For ye are bought with a price: therefore glorify God in your body, and in your spirit, which are God's.",
    "topic": "sexual_purity",
    "moral": "Your body belongs to God, not impulses. Purity is worship, not just rule-keeping.",
    "reflectionQ": "What boundaries protect your mind, eyes, and body when you’re alone and when you’re dating?",
    "challenge": "Write a purity rule-of-life (3 guardrails + 1 accountability plan) and share it with a trusted mentor.",
    "crossRefs": ["1 Thessalonians 4:3-5", "Job 31:1"],
    "length": "multi"
  },
  {
    "ref": "1 Thessalonians 4:3-5,7",
    "translation": "KJV",
    "passage": "For this is the will of God, even your sanctification, that ye should abstain from fornication: that every one of you should know how to possess his vessel in sanctification and honour; not in the lust of concupiscence, even as the Gentiles which know not God: For God hath not called us unto uncleanness, but unto holiness.",
    "topic": "sanctification",
    "moral": "God’s clear will: sexual holiness. Honor God by mastering desires, not being mastered by them.",
    "reflectionQ": "Which habits train you toward holiness (not just avoiding sin) each week?",
    "challenge": "Replace one risky media habit with 15 minutes of Bible and prayer for 7 days.",
    "crossRefs": ["2 Timothy 2:22", "Galatians 5:16"],
    "length": "multi"
  },
  {
    "ref": "Proverbs 4:23-27",
    "translation": "KJV",
    "passage": "Keep thy heart with all diligence; for out of it are the issues of life. Put away from thee a froward mouth, and perverse lips put far from thee. Let thine eyes look right on, and let thine eyelids look straight before thee. Ponder the path of thy feet, and let all thy ways be established. Turn not to the right hand nor to the left: remove thy foot from evil.",
    "topic": "guard_the_heart",
    "moral": "Direction follows attention. Guard inputs (eyes, mouth, steps) to guard your future.",
    "reflectionQ": "What input (account, playlist, friend circle) most shapes your desires right now?",
    "challenge": "Audit your feeds; unfollow one source that bends your heart the wrong way.",
    "crossRefs": ["Philippians 4:8", "Psalm 101:3"],
    "length": "multi"
  },
  {
    "ref": "Philippians 4:6-9",
    "translation": "KJV",
    "passage": "Be careful for nothing; but in every thing by prayer and supplication with thanksgiving let your requests be made known unto God. And the peace of God, which passeth all understanding shall keep your hearts and minds through Christ Jesus. Finally, brethren, whatsoever things are true, whatsoever things are honest, whatsoever things are just, whatsoever things are pure, whatsoever things are lovely, whatsoever things are off good report; if there be any virtue, and if there be any praise, think on these things. Those things, which ye have both learned, and received, and heard, and seen in me, do: and the God of peace shall be with you.",
    "topic": "anxiety_thoughts",
    "moral": "Pray honestly, thank specifically, think deliberately. Peace is guarded by practice.",
    "reflectionQ": "Which thought pattern do you need to replace with truth today?",
    "challenge": "Do a 3×3: list 3 worries, 3 thanks, 3 true thoughts; pray them aloud.",
    "crossRefs": ["1 Peter 5:7", "Isaiah 26:3"],
    "length": "multi"
  },
  {
    "ref": "James 2:14-17",
    "translation": "KJV",
    "passage": "What doth it profit, my brethren, though a man say he hath faith, and have not works? Can faith save him? If a brother or sister be naked and destitute of daily food, and one of you say unto them, depart in peace, be ye warmed and filled; notwithstanding ye give them not thode things which are needful to the bod; what doth ir profit? Even faith, if it hath not works, is dead, being alone.",
    "topic": "faith_works",
    "moral": "Real faith goes beyond words or belief; it's shown by actions that demonstrate God's love.",
    "reflectionQ": "Where could your faith become visible this week?",
    "challenge": "Serve a practical need (time, money, skill) without expecting return.",
    "crossRefs": ["Ephesians 2:10", "Matthew 5:16"],
    "length": "multi"
  },
  {
    "ref": "Micah 6:8",
    "translation": "KJV",
    "passage": "He hath shewed thee, O man, what is good; and what doth the LORD require of thee, but to do justly, and to love mercy, and to walk humbly with thy God?",
    "topic": "justice_mercy_humility",
    "moral": "God wants us to live with justice, mercy, and humility together; without action or humility, life is incomplete.",
    "reflectionQ": "Which of the three (justice, mercy, humility) is weakest in your current choices?",
    "challenge": "Plan one mercy+justice act this week (advocate, include, or give) done humbly.",
    "crossRefs": ["Matthew 23:23", "Zechariah 7:9"],
    "length": "single"
  },
  {
    "ref": "Matthew 5:27-28",
    "translation": "KJV",
    "passage": "Ye have heard that it was said by them of old time, Thou shalt not commit adultery: But I say unto you, That whosoever looketh on a woman to lust after her hath committed adultery with her already in his heart.",
    "topic": "purity_mind",
    "moral": "Jesus targets the heart, not just behavior. Purity starts where no one else can see.",
    "reflectionQ": "What triggers do you need to starve to guard your inner life?",
    "challenge": "Install/activate accountability or limits on the most tempting device today.",
    "crossRefs": ["Psalm 119:37", "Job 31:1"],
    "length": "single"
  },
  {
    "ref": "Ephesians 5:15-17",
    "translation": "KJV",
    "passage": "See then that ye walk circumspectly, not as fools, but as wise, redeeming the time, because the days are evil. Wherefore be ye not not unwise, but understanding what the will of the Lord is.",
    "topic": "time_wisdom",
    "moral": "Life is brief and full of trials, so spend your time wisely on good actions and meaningful pursuits.",
    "reflectionQ": "What low-value habit should be cut to redeem your week?",
    "challenge": "Reserve a 60-mintue 'high-value' slot for the next 5 days for activities such as scripture, study, or service.",
    "crossRefs": ["Psalm 90:12", "Colossians 4:5"],
    "length": "multi"
  },
  {
    "ref": "Colossians 3:1-4",
    "translation": "KJV",
    "passage": "If ye then be risen with Christ, seek those things which are above, where Christ sitteth on the right hand of God. Set your affection on things above, not on things on the earth. For ye are dead, and your life is hid with Christ in God. When Christ, who is our life, shall appear, then shall ye also appear with him in glory.",
    "topic": "identity_focus",
    "moral": "Focusing on spiritual values guides choices by love and faith, not selfishness.",
    "reflectionQ": "What earthly fixation most drags your affection downward?",
    "challenge": "Fast one earthly distraction for 3 days and replace with prayer.",
    "crossRefs": ["Philippians 3:20", "Matthew 6:33"],
    "length": "multi"
  },
  {
    "ref": "1 Peter 2:11-12",
    "translation": "KJV",
    "passage": "Dearly beloved, I beseech you as strangers and pilgrims, abstain from fleshly lusts, which war against the soul; having your conversation honest among the Gentiles: that, whereas they speak against you as evildoers, they may be your good works, which they shall behold, glorify God in the day of visitation.",
    "topic": "holy_distinct",
    "moral": "You’re a pilgrim, not a tourist. Living a good and upright life can lead others to see and honor God.",
    "reflectionQ": "Where do your habits look more like a tourist than a pilgrim?",
    "challenge": "Identify one war against your soul; share it with an accountability partner and pray.",
    "crossRefs": ["Romans 13:14", "Matthew 5:16"],
    "length": "multi"
  },
  {
    "ref": "Romans 13:11-14",
    "translation": "KJV",
    "passage": "And that, knowing the time, that now it is high time to awake out of sleep: for now is our salvation nearer then when we believed. The night is far spent, the day is at hand: let us therefore cast off the works of darkness, and let us put on the armour of light. Let us walk honestly, as in the day; not in rioting and drunkenness, not in chambering and wantonness, not in strife and envying. But put ye on the Lord Jesus Christ, and make not provision for the flesh, to fulfil the lusts thereof.",
    "topic": "wakefulness",
    "moral": "Holiness is urgent. Don’t schedule sin by leaving it easy and nearby.",
    "reflectionQ": "What ‘provision for the flesh’ exists in your phone or schedule?",
    "challenge": "Delete one app or routine that feeds temptation; replace with Scripture intake.",
    "crossRefs": ["Galatians 5:24-25"],
    "length": "multi"
  },
  {
    "ref": "Galatians 5:16-25",
    "translation": "KJV",
    "passage": "This I say then, Walk in the Spirit, and ye shall not fulfil the lust of the flesh. For the flesh lusteth against the spirit, and the spirit against the flesh: and these are contray the one to the other: so that ye cannot do the things that ye would. But if ye be led by the Spirit, ye are not under the law. Now the works of the flesh are manifest, which are these: adultery, fornication, uncleanness, lasciviousness, idolatry, witchcraft, hatred, variance, emulations, wrath, strife, seditions, heresies, envying, murders, drunkenness, revelings, and such: of the which i tell you before, as i have also told you in the time past, that they which do such things shall not inherit the kingdom of God. But the fruit of the Spirit is love, joy, peace, longsuffering, gentleness, goodness faith, meekness, temperance: against such there is no law. And they that are Christ's have crucified the flesh with the affections and lusts. If we live in the Spirit, let us also walk in the Spirit.",
    "topic": "spirit_walk",
    "moral": "Crucifying the flesh is daily. Spirit-led lives bear public fruit from private surrender.",
    "reflectionQ": "Which fruit needs cultivation this month? What fleshly habit must die for that fruit to grow?",
    "challenge": "Design a 14-day ‘fruit plan’ (habit + Scripture + accountability).",
    "crossRefs": ["Romans 8:13", "John 15:5"],
    "length": "multi"
  },
  {
    "ref": "Ephesians 6:10-18",
    "translation": "KJV",
    "passage": "Finally, my brethren, be strong in the Lord, and in the power of his might. Put on the whole armour of God, that ye may be able to stand against the wiles of devil. For we wrestle not against flesh and blood, but against principalities, against powers against the rulers of the darkness of the world, against spiritual wickedness in high place. WHerefore take unto you the whole armour of God, that ye may be able to withstand in the evil day, and having done all, to stand. Stand therefore, having your loins girt about the truth, and having on the breastplate of righteousness; and your feet shod with the preparation of the gospel of peace; above all, taking the shield of faith, wherewith ye shall be able to quench all the fiery darts of the wicked. And take the helment of salvation, and the sword of the Spirit, which isnthe word of God: praying always with all prayer and supplication in the Spirit, and watching thereunto with all perseverance and supplication for all saints.",
    "topic": "spiritual_warfare",
    "moral": "You’re in a war, not a playground. Armor up daily; truth and prayer are non-negotiable.",
    "reflectionQ": "Which piece of armor do you neglect most in practice?",
    "challenge": "Pray through each armor piece every morning for a week.",
    "crossRefs": ["1 Peter 5:8-9"],
    "length": "multi"
  },
  {
    "ref": "1 Corinthians 10:13",
    "translation": "KJV",
    "passage": "There hath no temptation taken you but such as is common to man: but God is faithful, who will not suffer you to be tempted above that ye are able; but will with temptation also make a way to escape, that ye may be able to bear it.",
    "topic": "temptation_escape",
    "moral": "God is trustworthy and will never let a temptation overwhelm you.",
    "reflectionQ": "What’s your pre-planned exit for your top temptation?",
    "challenge": "Write a 3-step escape plan and stick it by your mirror.",
    "crossRefs": ["James 4:7", "Matthew 26:41"],
    "length": "single"
  },
  {
    "ref": "1 Corinthians 10:31",
    "translation": "KJV",
    "passage": "Whether therefore ye eat, or drink, or whatsoever ye do, do all to the glory of God.",
    "topic": "whole_life_worship",
    "moral": "There are no ‘neutral’ moments. Ordinary routines can radiate God’s glory.",
    "reflectionQ": "What everyday task will you turn into worship today?",
    "challenge": "Pray before three ordinary tasks and do them excellently for Christ.",
    "crossRefs": ["Colossians 3:23-24"],
    "length": "single"
  },
  {
    "ref": "Colossians 3:12-17",
    "translation": "KJV",
    "passage": "Put on therefore, as the elect of God, holy and beloved, bowels of mercies, kindness, humbleness of mind, meekness, longsuffering; forbearing one another, and forgiving one another, if any man have a quarrel against any: even as Christ forgave you, so also do ye. And above all these things put on charity, which is the bond of perfectness. And let peace God rule in your hearts, to the which also ye are called in one body; and be ye thankful. Let the word of Christ dwell in you richly in all wisdom; teaching and admonishing one another in psalms and hymns and spiritual songs, singing with grace in your hearts to the Lord. And whatsoever ye do in the word or deed, do all in the name of the Lord Jesus, giving thanks to God and Father by him.",
    "topic": "community_character",
    "moral": "Practice mercy, kindness, humility, meekness, practice in your daily life. Let Scripture dwell richly so love rules deeply.",
    "reflectionQ": "Which ‘put on’ do your closest relationships need from you this week?",
    "challenge": "Write a short apology or affirmation you owe—and send it.",
    "crossRefs": ["Ephesians 4:32", "John 13:34"],
    "length": "multi"
  },
  {
    "ref": "1 Timothy 4:12-16",
    "translation": "KJV",
    "passage": "Let no man despise thy youth; but be thou an example of belivers, in word, in conversation, in charity, in spirit, in faith, in purity. Till I come, give attendance to reading, to exhortation, to doctrine. Neglect not the gift that is in thee, which was given thee by prophency, which the laying on of the hands of the presbytery. Meditate upon these things; give thyself wholly to them; that thy profiting may appear to all. Take heed unto thyself, and unto the doctrine; continue in them: for in doing this thou shalt both save thyself, and them that hear thee.",
    "topic": "youth_leadership",
    "moral": "Guard your own spiritual life and teaching, as this benefits both you and those who learn from you.",
    "reflectionQ": "What rhythm of Scripture reading and reflection will fuel your influence?",
    "challenge": "Plan a weekly 30-min Bible/study block and guard it for a month.",
    "crossRefs": ["Titus 2:7", "Joshua 1:8"],
    "length": "multi"
  },
  {
    "ref": "Titus 2:11-14",
    "translation": "KJV",
    "passage": "For the grace of God that bringeth salvation hath appeared to all men, teaching us that, denying ungodliness and wordly lusts,  we should live soberly, righteously, and godly, in this present world; looking for that blessed hope, and the glorious appearing of the great God and our Saviour Jesus Christ; who gave himself for us, that he might redeem us from all iniquity, and purify unto himself a peculiar people, zealous of good works.",
    "topic": "grace_training",
    "moral": "God's grace teaches us to turn away from sin and worldly desires.",
    "reflectionQ": "What ‘no’ and what ‘yes’ is grace teaching you right now?",
    "challenge": "Write two lines: ‘I will deny ____; I will pursue ____’ and review daily for a week.",
    "crossRefs": ["Romans 6:12-13"],
    "length": "multi"
  },
  {
    "ref": "1 Peter 3:15-16",
    "translation": "KJV",
    "passage": "But sanctify the LORD God in your hearts: be ready always to give an answer to every man that asketh you a reason of the hope that is in you with meekness and fear: Having a good conscience; that, whereas they speak evil of you, as of evildoers, they may be ashamed that falsely accuse your good conversation in Christ.",
    "topic": "apologetics",
    "moral": "Share your faith with meekness, not arrogance or anger. Character validates content.",
    "reflectionQ": "How would you explain the gospel to a skeptical friend in 60 seconds?",
    "challenge": "Write a 5-sentence testimony (before/Jesus/after) and practice it once.",
    "crossRefs": ["Colossians 4:6"],
    "length": "multi"
  },
  {
    "ref": "2 Corinthians 5:17-20",
    "translation": "KJV",
    "passage": "Therefore if any man be in Christ, he is a new creature: old things are passed away; behold, all things are become new. And all things are of God, who hath reconciled us to himself by Jesus Christ, and hath given to us the mininstry of reconciliation; to wit, that God was in Christ, reconciling the world unto himself, not imputing their trespasses unto them; and hath committed unto us the word of reconciliation. Now then we are ambassadors for Christ, as though God did beseech you by us: we pray you in Christ's stead, by ye reconciled to God.",
    "topic": "identity_mission",
    "moral": "Believers become new creations; past sins and failures do not define them. Christians are called to spread God's message of forgiveness.",
    "reflectionQ": "Where will you step in as an ambassador this week?",
    "challenge": "Initiate one spiritual conversation with a peer (question + listen).",
    "crossRefs": ["Matthew 5:16", "Acts 1:8"],
    "length": "multi"
  },
  {
    "ref": "Matthew 28:18-20",
    "translation": "KJV",
    "passage": "And Jesus came and spake unto them, saying, All power is given unto me in heaven and in earth. Go ye therefore, and teach all nations, baptizing them in the name of the Father and of the Son, and of the Holy Ghost: teaching them to observe all things whatsoever I have commanded you: and, lo, I am with you alway, even unto the end of the world. Amen.",
    "topic": "great_commission",
    "moral": "Jesus’ authority fuels our assignment. He sends and stays with us throughout our journey.",
    "reflectionQ": "Who are your two ‘go to’ people to pray for and engage this month?",
    "challenge": "Make a simple 3×3 list: 3 to pray for, 3 to invite, 3 to serve.",
    "crossRefs": ["John 20:21", "Romans 10:14"],
    "length": "multi"
  },
  {
    "ref": "Acts 1:8",
    "translation": "KJV",
    "passage": "But ye shall receive power, after that the Holy Ghost is come upon you: and ye shall be witnesses unto me both in Jerusalem, and in all Judaea, and in Samaria, and unto the uttermost part of the earth.",
    "topic": "spirit_power",
    "moral": "True strength to witness comes from the Holy Spirit.",
    "reflectionQ": "Where do you need courage from the Spirit to speak?",
    "challenge": "Pray for boldness, then share one God-story this week.",
    "crossRefs": ["Ephesians 6:19-20"],
    "length": "single"
  },
  {
    "ref": "1 Peter 1:6-7",
    "translation": "KJV",
    "passage": "Wherein ye greatly rejoice, though now for a season, if need be, ye are in heaviness through manifold temptations: That the trial of your faith, being much more precious than of gold that perisheth, through it be tried with fire, might be found unto praise and honour and glory at the appearing of Jesus Christ.",
    "topic": "trials_refining",
    "moral": "Challenges strengthen faith life fire refines gold.",
    "reflectionQ": "What would ‘refined faith’ look like in your current hardship?",
    "challenge": "Journal the gains God could forge from your trial; pray them aloud.",
    "crossRefs": ["James 1:2-4", "Romans 5:3-5"],
    "length": "multi"
  },
  {
    "ref": "Romans 5:1-5",
    "translation": "KJV",
    "passage": "Therefore being justified by faith, we have peace with God through our Lord Jesus Christ: By whom also we have access by faith into this grace wherein we stand, and rejoice in hope of the glory of God. And not only so, but we glory in tribulations also: knowing that tribulations worketh patience; and patience, experience; and experience, hope: and hope maketh not ashamed; because the love of God is shed abroad in our hearts by the Holy Ghost which is given unto us.",
    "topic": "gospel_hope",
    "moral": "Believers are justified and reconciled with God through faith in Christ.",
    "reflectionQ": "How does being justified reshape your view of setbacks?",
    "challenge": "Memorize Romans 5:1–2; recite when frustration rises.",
    "crossRefs": ["Romans 8:31-39"],
    "length": "multi"
  },
  {
    "ref": "Romans 8:12-14",
    "translation": "KJV",
    "passage": "Therefore, brethren, we are debtors, not to the flesh, to live after the flesh. For if ye through the Spirit do mortify the deeds of the body, ye shall live. For as many as are led by the Spirit of God, they are the sons of God.",
    "topic": "mortification",
    "moral": "We are not obligated to live according to fleshly desires.",
    "reflectionQ": "What habit needs ‘mortifying’ this month and how will you do it?",
    "challenge": "Create a ‘kill sin’ plan: triggers → truth → tool (call, block, leave).",
    "crossRefs": ["Colossians 3:5", "Galatians 5:24"],
    "length": "multi"
  },
  {
    "ref": "Hebrews 12:1-2",
    "translation": "KJV",
    "passage": "Wherefore seeing we also are compassed about with so great a cloud of witnesses, let us lay aside every weight, and the sin which doth so easily beset us, and let us run with patience the race that is set before us, Looking unto Jesus the author and finisher of our faith; who for the joy that was set before him endured the cross, despising the shame, and is set down at the right hand of the throne of God.",
    "topic": "endurance_focus",
    "moral": "Run your race with eyes fixed on Jesus, not the crowd. Let go of anything that slows your spiritual progress.",
    "reflectionQ": "What weight (not sin) is slowing your run?",
    "challenge": "Delete or limit one neutral weight for 7 days and track the difference.",
    "crossRefs": ["1 Corinthians 9:24-27"],
    "length": "multi"
  },
  {
    "ref": "Psalm 119:9-16",
    "translation": "KJV",
    "passage": "Wherewithal shall a young man cleanse his way? by taking heed thereto according to thy word. With my whole heart have I sought thee: O let me not wander from thy commandments. Thy word have I hid in mine heart, that I might not sin against thee. Blessed art thou, O LORD: teach me thy statutes. With my lips have i declared all the judgements of thy mouth. I have rejoiced in the way of thy testimonies, as much as in all riches. I will meditate in thy precepts, and have respect unto the ways. I will delight myself in thy statutes: I will not forget thy word.",
    "topic": "scripture_habits",
    "moral": "Purity is powered by Scripture delight, not mere grit. Hiding God's Word in the heart strengthens resistance to sin.",
    "reflectionQ": "When will you consistently store Scripture in your heart each day?",
    "challenge": "Start a verse-bank: memorize 2 verses this week and review daily.",
    "crossRefs": ["Joshua 1:8", "2 Timothy 3:16"],
    "length": "multi"
  },
  {
    "ref": "Psalm 139:13-16",
    "translation": "KJV",
    "passage": "For thou hast possessed my reins: thou hast covered me in my mother's womb. I will praise thee; for I am fearfully and wonderfully made: maarvellous are thy works; and that my soul knoweth right well. My substance was not hid from thee, when I was made in secret, and curiously wrought in the lowest parts of the earth. Thine eyes did see my substance, yet being unperfect; and in thy book all members were written, which in continuance were fashioned, when as yet there was none of them.",
    "topic": "imago_dei",
    "moral": "God designed you on purpose, for purpose. Identity begins in His artistry.",
    "reflectionQ": "How does being ‘wonderfully made’ change the way you treat your body and mind?",
    "challenge": "Write three truths about your God-given design and thank Him aloud.",
    "crossRefs": ["Ephesians 2:10"],
    "length": "multi"
  },
  {
    "ref": "Proverbs 27:17",
    "translation": "KJV",
    "passage": "Iron sharpeneth iron; so a man sharpeneth the countenance of his friend.",
    "topic": "accountability",
    "moral": "True friends help each other grow in wisdom and virtue.",
    "reflectionQ": "Who has permission to challenge your choices?",
    "challenge": "Invite one friend/mentor to ask you two hard questions weekly.",
    "crossRefs": ["Hebrews 10:24-25"],
    "length": "single"
  },
  {
    "ref": "Proverbs 13:20",
    "translation": "KJV",
    "passage": "He that walketh with wise men shall be wise: but a companion of fools shall be destroyed.",
    "topic": "friendship_wisdom",
    "moral": "Your circle is your forecast. Your friends shape who you become.",
    "reflectionQ": "Which friendship is pulling you toward folly? What boundary is needed?",
    "challenge": "Plan one intentional meet-up with a wise person this week.",
    "crossRefs": ["Psalm 1:1"],
    "length": "single"
  },
  {
    "ref": "Proverbs 1:10-15",
    "translation": "KJV",
    "passage": "My son, if sinners entice thee, consent thou not. If they say, Come with us, let us lay wait for blood, let us lurk privily for the innocent without cause: let us swallow the up alive as the grave; and whole, as those that go down into the pit: we shall find all precious substance, we shall fill our house with spoil: cast in thy lot among us; let uus all have one purse: My son, walk not thou in the way with them; refrain thy foot from their path.",
    "topic": "peer_pressure",
    "moral": "Predetermine your ‘no’ before pressure arrives. Path matters more than moment.",
    "reflectionQ": "What scenario needs your pre-set ‘no’ this month?",
    "challenge": "Write a firm refusal sentence and rehearse it aloud.",
    "crossRefs": ["Daniel 1:8"],
    "length": "multi"
  },
  {
    "ref": "Matthew 6:19-21,24",
    "translation": "KJV",
    "passage": "Lay not up for yourselves treasures upon earth, where moth and rust doth corrupt, and where thieves break through and steal: but lay up for yourselves treasures in heaven, where thieves do not break through nor steal: for where your treasure is, there will your heart be also. No man can serve two masters: for either he will hate the one, and love the other; or else he will hold to the one, and despise the other. Ye cannot serve God and mammon.",
    "topic": "treasure_loyalty",
    "moral": "Earthly riches fade, but heavenly treasures last forever.",
    "reflectionQ": "How can i shift my focus from temporary satisfaction to eternal purpose?",
    "challenge": "Give or save before you spend this week; note how it shifts your heart.",
    "crossRefs": ["Colossians 3:2"],
    "length": "multi"
  },
  {
    "ref": "Luke 16:10-12",
    "translation": "KJV",
    "passage": "He that is faithful in that which is least is faithful also in much: and he that is unjust in the least is unjust also in much. If therefore ye have not been faithful in the unrighteous mammon, who will commit to your trust the true riches? And if ye have not been faithful in that which is another man's, who shall give you that which is your own?",
    "topic": "stewardship",
    "moral": "Faithfulness grows in small assignments before big ones.",
    "reflectionQ": "What ‘little thing’ needs your consistent faithfulness?",
    "challenge": "Track one stewardship (e.g chores, time) for 7 days; no skips.",
    "crossRefs": ["Matthew 25:21"],
    "length": "multi"
  },
  {
    "ref": "Matthew 25:21",
    "translation": "KJV",
    "passage": "His Lord said unto him, well done, thou good and faithful servant: thou hast been faithful over a few things, I will make thee ruler over many things: enter thou into the joy of thy Lord.",
    "topic": "reward_faithfulness",
    "moral": "‘Well done’ comes from long obedience in little things.",
    "reflectionQ": "Where do you want to hear ‘well done’—and what habit leads there?",
    "challenge": "Choose one ‘few things’ task and execute excellently all week.",
    "crossRefs": ["Luke 16:10"],
    "length": "single"
  },
  {
    "ref": "Luke 10:27,36-37",
    "translation": "KJV",
    "passage": "And he answering said, Thou shalt love the Lord thy God with all thy heart, and with all thy soul, and with all thy strenghth, and with all thy mind; and thy neighbour as thyself. Which now of these three, thinkest thou, was neighbour unto him that fell among the thieves? And he siad, He that shewed mercy on him. Then said Jesus unto him, Go, and do thou like wise.",
    "topic": "neighbor_love",
    "moral": "Christ calls us to live out love in our daily life.",
    "reflectionQ": "Who is your ‘unlikely neighbor’ at school or online?",
    "challenge": "Do one costly kindness for someone outside your group.",
    "crossRefs": ["James 2:8"],
    "length": "multi"
  },
  {
    "ref": "Esther 4:14",
    "translation": "KJV",
    "passage": "For if thou altogether holdest thy peace at this time, then shall there enlargement and deliverance arise to the Jews from another place; but thou and thy father's house shall be destroyed: and who knoweth whether thou art come to the kingdom for such a time as this?",
    "topic": "calling_courage",
    "moral": "God positions you on purpose. Every position, season, and opportunity may serve a divine plan.",
    "reflectionQ": "What ‘such a time as this’ moment might be in front of you?",
    "challenge": "Name one courageous step and do it within 72 hours.",
    "crossRefs": ["Joshua 1:9"],
    "length": "single"
  },
  {
    "ref": "Daniel 3:16-18",
    "translation": "KJV",
    "passage": "Shadrach, Meshach, and Abednego, answered and said to the king Nebuchadnezzer, we are careful to answer thee in this matter. If it be so, our God whom we serve is able to deliver us from the burning fiery furnace, and he will deliver us out of thine hand, O king. But if not, be it known unto thee, O king, that we will not serve thy gods, nor worship the golden image which thou hast set up.",
    "topic": "noncompromise",
    "moral": "Standing for righteousness may require defiance against powerful authorities.",
    "reflectionQ": "How do i handle situations where compromise seems easier than faithfulness?",
    "challenge": "Write your non-negotiables and share with accountability.",
    "crossRefs": ["Acts 5:29"],
    "length": "multi"
  },
  {
    "ref": "Nehemiah 6:3",
    "translation": "KJV",
    "passage": "So I sent messengers unto them, saying, I am doing a great work, so that I cannot come down: why should the work cease, whilst I leave it, and come down to you?",
    "topic": "focus",
    "moral": "Great work requires great ‘no’s. Distraction is often opposition in disguise.",
    "reflectionQ": "What distractions pull you down from your ‘wall’?",
    "challenge": "Run two 45-minute deep-work blocks this week with devices away.",
    "crossRefs": ["Ephesians 5:16"],
    "length": "single"
  },
  {
    "ref": "James 3:5-10",
    "translation": "KJV",
    "passage": "Even so the tongue is a little member, and boasteth great things. Behold, how great a matter a little fire kindleth! And the tongue is a fire, a word of iniquity: so is the tongue among our members, that it defileth the whole body, and setteth on fire the course of nature; and it is set on fire of hell. For every kind of beasts, and of birds, and of serpents, and of things in the sea, is tamed, and hath been tamed of mankind: but the tongue can no man tame; it is an unruly evil, ful of deadly poison. Therewith bless we God, even the Father; and therewith curse we man, which are made after the similitude of God. Out of the smae mouth proceedth blessing and cursing. My brethren, these things ought not so to be.",
    "topic": "speech_power",
    "moral": "Harsh or careless words can cause deep, lasting damage. Worship and slander can’t share one mouth.",
    "reflectionQ": "What pattern (sarcasm, gossip, shade) needs repentance?",
    "challenge": "24-hour no-complaint, no-gossip fast; replace with blessing.",
    "crossRefs": ["Ephesians 4:29", "Proverbs 18:21"],
    "length": "multi"
  },
  {
    "ref": "Ephesians 4:29",
    "translation": "KJV",
    "passage": "Let no corrupt communication proceed out of your mouth, but that which is good to the use of edifying, that it may minister grace unto the hearers.",
    "topic": "edifying_words",
    "moral": "Use words to encourage, teach, and uplift. Avoid harmful, corrupt, or destructive words.",
    "reflectionQ": "Who needs targeted encouragement from you today?",
    "challenge": "Send two concrete, specific encouragements before bedtime.",
    "crossRefs": ["Colossians 4:6"],
    "length": "single"
  },
  {
    "ref": "Matthew 18:15-17",
    "translation": "KJV",
    "passage": "Moreover if thy brother shall trespass against thee, go and tell him his fault between thee and him alone: if he shall hear thee, thou hast gained a brother. But if he will not hear thee, then take with thee one or two more, that in the mouth of two or three witnesses every word may be established. And if he shall neglect to hear them, tell it unto the church: but if he neglect to hear the church, let him be unto thee as an heathen man and a publican.",
    "topic": "conflict_resolution",
    "moral": "Approach conflicts with humility and a willingness to restore relationships rather than escalate.",
    "reflectionQ": "Who do you need to meet with privately to make peace?",
    "challenge": "Set up a grace-filled, face-to-face conversation this week.",
    "crossRefs": ["Romans 12:18"],
    "length": "multi"
  },
  {
    "ref": "Matthew 18:21-22",
    "translation": "KJV",
    "passage": "Then came Peter to him, and said, Lord, how oft shall my brother sin against me, and I forgive him? till seven times? Jesus saith unto him, I say not unto thee, Until seven times: but, Until seventy times seven.",
    "topic": "forgiveness.",
    "moral": "Choosing forgiveness fosters peace, healing and stronger relationships.", 
    "reflectionQ": "What offense are you still counting that God is calling you to release?",
    "challenge": "Pray daily for that person’s good for 5 days.",
    "crossRefs": ["Ephesians 4:32"],
    "length": "multi"
  },
  {
    "ref": "Hebrews 13:5",
    "translation": "KJV",
    "passage": "Don't love money; be satisfied with what you have. For God has said, 'I will never fail you. I will never abandon you.'",
    "topic": "contentment_presence",
    "moral": "Be grateful for what you have; contentment is a form of spiritual strength.",
    "reflectionQ": "How can i practice gratitude each day to strengthen contentment?",
    "challenge": "Do a 48-hour ‘no new stuff’ practice; write three ways God showed up instead.",
    "crossRefs": ["Philippians 4:11-13"],
    "length": "single"
  },
  {
    "ref": "1 John 2:15-17",
    "translation": "KJV",
    "passage": "Love not the world, neither the things that are in the world. If any man love the world, the love of the Father is not in him. For all that is in the world, the lust of the flesh, and the lust of the eyes, and the pride of life, is not of the Father, but is of the world. And the world passeth away, and the lust thereof: but he that doeth the will of God abideth for ever.",
    "topic": "worldliness",
    "moral": "Lust and pride promise satisfaction but leave the soul empty. Seek spiritual growth, not worldly status.",
    "reflectionQ": "Which of the three (flesh, eyes, pride) hooks you most?",
    "challenge": "Fast from that hook for 72 hours; fill the space with service.",
    "crossRefs": ["Romans 12:2"],
    "length": "multi"
  },
  {
    "ref": "1 Peter 5:6-10",
    "translation": "KJV",
    "passage": "Humble yourselves therefore under the mighty hand of God, that he may exalt you in due time: Casting all your care upon him; for he careth for you. Be sober, be vigilant; because your adversary the devil, as a roaring lion, walketh about, seeking whom he may devour: Whom resist stedfast in the faith, knowing that the same afflictions are ccomplished in your brethren that are in the world. But the God of all grace, who hath called us unto his eternal glory by Christ Jesus, after that ye have suffered a while, make you perfect, stablish, strengthen, settle you.",
    "topic": "humility_resistance",
    "moral": "Cast all your burdens on God because He genuinely cares.",
    "reflectionQ": "What burden do you keep carrying instead of casting?",
    "challenge": "Write and pray a ‘cast list’ of three anxieties nightly this week.",
    "crossRefs": ["James 4:7-10"],
    "length": "multi"
  },
  {
    "ref": "2 Timothy 3:16-17",
    "translation": "KJV",
    "passage": "All scripture is given by inspiration of God, and is profitable for doctrine, for reproof, for correction, for instruction in righteousness: that the man of God may be perfect, throughly furnished unto all good works.",
    "topic": "scripture_equips",
    "moral": "Being morally amd spiritually equipped enables you to contribute positively to soceity.",
    "reflectionQ": "Which of Scripture’s purposes (teaching, reproof, correction, training) do you resist?",
    "challenge": "Let one hard verse correct you today—and act on it within 24 hours.",
    "crossRefs": ["Hebrews 4:12"],
    "length": "multi"
  },
  {
    "ref": "James 4:13-15",
    "translation": "KJV",
    "passage": "Now listen, you who say, 'Today or tomorrow we are going to a certain town and will stay there a year, carrying on business and making money.' How do you know what your life will be like tomorrow? Your life is like the morning fog; it's here a little while, then it vanishes. Instead, you ought to say 'if the Lord wills, we will live and do this or that.",
    "topic": "humble_planning",
    "moral": "Recognize that ultimately, God is in control of your life and decisions. Seek God's guidance when making plans or setting goals.",
    "reflectionQ": "Where do you plan as if God isn’t part of the equation?",
    "challenge": "Add ‘DV’ (Deo volente) to your next plan and pray it sincerely.",
    "crossRefs": ["Proverbs 16:9"],
    "length": "multi"
  },
  {
    "ref": "Philippians 3:12-14",
    "translation": "KJV",
    "passage": "Not as though i had already attained, either were already perfect: but i follow after, if that i may apprehend that for which also i am apprehended: but this one thing i do, forgetting those things which are behind, and reaching forth unto those things which are before. I press toward the mark for the prize of the high calling of God in Christ Jesus.",
    "topic": "perseverance_goal",
    "moral": "Don’t camp in past wins or wounds. Press toward Christ’s call.",
    "reflectionQ": "What weight from the past must you release to run?",
    "challenge": "Name one concrete next step toward your God-given goal; do it this week.",
    "crossRefs": ["Hebrews 12:1"],
    "length": "multi"
  },
  {
    "ref": "Colossians 3:5-10",
    "translation": "KJV",
    "passage": "Mortify therefore your members which are upon the earth; fornication, uncleanness, inordinate affection, evil concupiscence, and covetousness, which is idolatry: For which things' sake the wrath God cometh on children of disobedience: In the which ye also walked some time, when ye lived in them. But now y also put off all these; anger, wrath, malice, blasphemy, filthy communication out of your mouth. Lie not one to another, seeing that ye have put off the old man with his deeds; and have put on the new man, which is renewed in knowledge after the image of him that created him.",
    "topic": "put_off_put_on",
    "moral": "A moral life means turning from wrongdoing and embracing virtues through self-awareness and spiritual renewal.",
    "reflectionQ": "Which ‘put off’ and which ‘put on’ do you need most this week?",
    "challenge": "Pair one sin to kill with one virtue to practice for 10 days.",
    "crossRefs": ["Ephesians 4:22-24"],
    "length": "multi"
  },
  {
    "ref": "Matthew 5:3-10",
    "translation": "KJV",
    "passage": "Blessed are the poor in spirit: for theirs is the kingdom of heaven. Blessed are they that mourn: for they shall be comforted. Blessed are the meek: for they shall inherit the earth. Blessed are they which do hunger and thirst after righteousness: for they shall be filled. Blessed are the merciful: for they shall obtain mercy. Blessed are the peacemakers: for they shall be called the children of God. Blessed are they which are persecuted for righteousness' sake: for theirs is the kingdom of heaven.",
    "topic": "kingdom_character",
    "moral": "True blessings come from a heart aligned with God, not from worldly power. Hunger for righteousness over relevance.",
    "reflectionQ": "Which Beatitude most counters your current mindset?",
    "challenge": "Choose one Beatitude to pray and practice daily for a week.",
    "crossRefs": ["Galatians 5:22-23"],
    "length": "multi"
  },
  {
    "ref": "Matthew 7:24-27",
    "translation": "KJV",
    "passage": "Therefore whosoever heareth these sayings of mine, and doeth them I will liken him unto a wise man, which built his house upon a rock: And the rain descended, and the floods came, and the winds blew, and beat upon that house; and it fell not: for it was founded upon a rock. And every one that heareth these sayings of mine, and doeth them not, shall be likened unto a follish man, which built his house upon the sand: And the rain descended, and the floods came, and the winds blew, and beat upon that house; and it fell: and great was the fall of it.",
    "topic": "obedience_foundation",
    "moral": "A secure life comes from applying God's teachings, especially in times of trial. Ignorning moral and spiritual guidance can result in failure and rerget.",
    "reflectionQ": "What clear command have you delayed obeying?",
    "challenge": "Do one specific obedience within 24 hours; tell your accountability partner.",
    "crossRefs": ["James 1:22"],
    "length": "multi"
  },
  {
    "ref": "Romans 14:19",
    "translation": "KJV",
    "passage": "Let us therefore follow after the things which make for peace, and things wherewith one may edify another.",
    "topic": "peacemaking",
    "moral": "A virtuous life promotes peace and uplifts others.",
    "reflectionQ": "What would ‘follow after peace’ require in your current conflict?",
    "challenge": "Craft and send a peacemaking message or apology today.",
    "crossRefs": ["Matthew 5:9"],
    "length": "single"
  },
  {
    "ref": "1 Corinthians 9:24-27",
    "translation": "KJV",
    "passage": "Don't you realize that in a race everyone runs, but only one person gets the prize? So run to win! All athletes are discipllined in their training. They do it to win a prize that will fade away, but we do it for an eternal prize. So i run with purpose in every step. I am not just shadowboxing. I discipline my body like an athlete, training it to do what it should. Otherwise, i fear that after preaching to others i myself might be disqualified.",
    "topic": "discipline",
    "moral": "Be intentional and disciplined in pursuing your goals, especially spiritual ones.",
    "reflectionQ": "Which body habit (sleep, food, screen) needs discipline to serve your soul?",
    "challenge": "Set a 10-day training rule (bedtime, study block, screen cap) and keep it.",
    "crossRefs": ["Hebrews 12:11"],
    "length": "multi"
  },
  {
    "ref": "Matthew 6:5-6",
    "translation": "KJV",
    "passage": "And when thou prayest, thou shalt not be as the hypocrites are: for they love to pray standing in the synagogues and in the corners of the streets, that they may be seen of men. Verily i say unto you, they have their reward. But thou, when thou prayest, enter into thy closet, and when thou hast shut thy door, pray to thy Father which is in secert; and they Father which seeth in secret shall reward thee openly.",
    "topic": "secret_prayer",
    "moral": "Be genuine in your spiritual practices; sincerity matters more than appearances. Meet God in secret to live for Him in public.",
    "reflectionQ": "When and where is your daily secret place?",
    "challenge": "Start a 10-minute daily prayer window for 10 days; no phone allowed.",
    "crossRefs": ["Mark 1:35"],
    "length": "multi"
  },
  {
    "ref": "Psalm 15:1-4",
    "translation": "KJV",
    "passage": "Lord, who shall abide in thy tabernacle? Who shall dwell in thy holy hill? He that walketh uprightly, and worketh righteousness, and speaketh the truth in his heart. He that backbiteth not with his tongue, nor doeth evil to his neighbour, nor taketh up a reproach against his neighbour. In those eyes, a vile person is contemned; but he honoureth them that fear the Lord. He sweareth to his own hurt, and changeth not.",
    "topic": "integrity",
    "moral": "Live with integrity; align your actions with your conscience and beliefs.",
    "reflectionQ": "Where do you need to keep your word though it hurts?",
    "challenge": "Make one hard right choice and record the cost and the fruit.",
    "crossRefs": ["Proverbs 11:3"],
    "length": "multi"
  },
  {
    "ref": "Proverbs 6:23-28",
    "translation": "KJV",
    "passage": "For the commandment is a lamp; and the law is light; and reproofs of instruction are the way of life. To keep thee from the evil woman from the flattery of the tongue of strange woman. Lust not after her beauty in thine heart; neither let her take thee with her eyelids. For by means of a whorish woman a man is brought to a piece of bread: and the adulteress will hunt for the precious life. Can a man take fire in his bosom, and his clothes not be burned?",
    "topic": "lust_warning",
    "moral": "Exercise discipline over your impulses to avoid harmful consequences.",
    "reflectionQ": "What ‘near fire’ situation do you need to avoid completely?",
    "challenge": "Name and nuke one flirt-with-line behavior this week.",
    "crossRefs": ["Matthew 5:29-30"],
    "length": "multi"
  },
  {
    "ref": "John 15:4-5",
    "translation": "KJV",
    "passage": "Abide in me, and I in you. As the branch cannot bear fruit of itself, except it abide in the vine; no more can ye, except ye abide in me. I am the vine, ye are the branches: He that abideth in me, and I in him, the same bringeth forth much fruit: for without me ye can do nothing.",
    "topic": "abiding",
    "moral": "Cultivate a continuous, living relationship with God through prayer, obedience, and faith.",
    "reflectionQ": "What practice most helps you remain with Jesus daily?",
    "challenge": "Do a 15-minute abide block: read, reflect, respond in prayer.",
    "crossRefs": ["Galatians 5:22-23"],
    "length": "multi"
  },
  {
    "ref": "Psalm 37:23-24",
    "translation": "KJV",
    "passage": "The steps of a good man are ordered by the LORD: and he delighteth in his way. Though he fall, he shall not be utterly cast down: for the LORD upholdeth him with his hand.",
    "topic": "guidance_resilience",
    "moral": "Seek God's guidance in decisions; trust that He will lead you along the right path.",
    "reflectionQ": "Where did you fall recently—and how did God steady you?",
    "challenge": "Share a brief ‘God held me’ story with a younger student.",
    "crossRefs": ["Proverbs 24:16"],
    "length": "multi"
  },
  {
    "ref": "Matthew 10:32-33",
    "translation": "KJV",
    "passage": "Whosoever therefore shall confess me before men, him will I confess also before my Father which is in heaven. But whosoever shall deny me before men, him will I also deny before my Father which is in heaven.",
    "topic": "public_faith",
    "moral": "Jesus honors those who own Him openly. Silence can be a denial.",
    "reflectionQ": "Where have you been silent about Jesus out of fear?",
    "challenge": "Post or share a gracious, clear reason for your hope this week.",
    "crossRefs": ["Romans 1:16"],
    "length": "multi"
  },
  {
    "ref": "Colossians 4:5-6",
    "translation": "KJV",
    "passage": "Walk in wisdom toward them that are without, redeeming the time. Let your speech be always with grace, seasoned with salt, that ye may know how ye ought to answer every man.",
    "topic": "witness_wisdom",
    "moral": "Speak with respect, gentleness, and wisdom; words can influence hearts and minds.",
    "reflectionQ": "Which non-believer could you engage wisely this week?",
    "challenge": "Prepare one curious, respectful question to ask them.",
    "crossRefs": ["1 Peter 3:15"],
    "length": "multi"
  },
  {
    "ref": "Psalm 73:25-26",
    "translation": "KJV",
    "passage": "Whom have I in heaven but thee? And there is none upon the earth that i desire besides thee. My flesh and my heart faileth: but God is the strength of my heart, and my portion for ever.",
    "topic": "satisfaction_in_God",
    "moral": "Focus on lasting spiritual treasures rather than fleeting earthly desires.",
    "reflectionQ": "What rival ‘savior’ do you run to for comfort first?",
    "challenge": "Fast from that rival for 48 hours and turn to prayer and praise.",
    "crossRefs": ["Jeremiah 2:13"],
    "length": "multi"
  },
  {
    "ref": "1 John 1:7-9",
    "translation": "KJV",
    "passage": "But if we walk in the light, we have fellowship with one another, and the blood of Jesus Christ his son cleanseth us from all sin. If we say that we have no sin, we deceive ourselves, and the truth is not with us. If we confess our sins, he is faithful and just to forgive us our sins, and cleanse us from all unrighteousness.",
    "topic": "confession_light",
    "moral": "Trust in God's mercy and justice; He forgives and renews those who sincerely repent.",
    "reflectionQ": "What secret needs confession to God and a trusted believer?",
    "challenge": "Confess one hidden sin today and receive prayer.",
    "crossRefs": ["James 5:16"],
    "length": "multi"
  },
  {
    "ref": "Matthew 22:37-39",
    "translation": "KJV",
    "passage": "Jesus said unto him, 'Thou shalt love the Lord thy God with all thy heart, and with all thy soul, and with all thy mind.' This is the first commandment. And the second is like unto it, Thou shalt love thy neighbour as thyself.",
    "topic": "great_command",
    "moral": "Life’s target is love—first God, then people. Spiritual life is shown by how we treat others, not just by personal devotion.",
    "reflectionQ": "Which area (heart, soul, mind) is least engaged in loving God now?",
    "challenge": "Plan one act of worship and one act of costly love this week.",
    "crossRefs": ["Deuteronomy 6:5"],
    "length": "multi"
  },
  {
    "ref": "Psalm 19:7-11",
    "translation": "KJV",
    "passage": "The law of the LORD is perfect, converting the soul: the testimony of the LORD is sure, making wise the simple. The status of the LORD are right, rejoicing the heart: the commandment of the LORD is pure, enlightening the eyes. The fear of the LORD is clean, enduring for ever: the judgments of the LORD are true and righteous altogether. More to be desired are they than gold, yea, than much fine gold: sweeter also than honey and the honeycomb. Moreover by them is thy servant warned: and keeping there is great reward.",
    "topic": "value_of_word",
    "moral": "Scripture revives, instructs, and protects. Treat it as treasure, not task.",
    "reflectionQ": "How will you move from duty to delight in Bible intake?",
    "challenge": "Do a slow read of these verses; list 3 benefits and pursue one today.",
    "crossRefs": ["Hebrews 4:12", "Psalm 119:11"],
    "length": "multi"
  },
    
  {
    "ref": "Genesis 4:7",
    "translation": "KJV",
    "passage": "If thou doest not well, shalt thou be accepted? And if thou doest not well, sin lieth at the door. And unto thee shall be his desire, and thou shalt rule over him.",
    "topic": "temptation_alert",
    "moral": "Sin waits at the door, but you are called to rule it—not be ruled by it.",
    "reflectionQ": "Where is sin ‘at the door’ for you this week?",
    "challenge": "Name one trigger and one escape route; message it to your accountability partner.",
    "crossRefs": ["1 Corinthians 10:13", "James 4:7"],
    "length": "single"
  },
  {
    "ref": "Genesis 2:24",
    "translation": "KJV",
    "passage": "Therefore shall a man leave his father and his mother, and shall cleave unto his wife: and they shall be one flesh.",
    "topic": "dating_boundaries",
    "moral": "God’s design for intimacy is covenant, not convenience. Marriage is a sacred union built on love, unity and faithfulness.",
    "reflectionQ": "Do your dating boundaries honor God’s covenant design?",
    "challenge": "Write three Christ-centered dating boundaries and share with a mentor.",
    "crossRefs": ["1 Thessalonians 4:3-5", "Hebrews 13:4"],
    "length": "single"
  },
  {
    "ref": "Genesis 50:20",
    "translation": "KJV",
    "passage": "But as for you, ye thought evil against me; but God meant it unto good, to bring to pass, as it is this day, to save much people alive.",
    "topic": "providence",
    "moral": "Evil intentions cannot destory God's plans. He can transform darkness into light.",
    "reflectionQ": "Where could God be working good from a hard story in your life?",
    "challenge": "Journal two ways God might use your setback to serve others.",
    "crossRefs": ["Romans 8:28", "Psalm 37:23-24"],
    "length": "single"
  },
  {
    "ref": "Exodus 23:2",
    "translation": "KJV",
    "passage": "Thou shalt not follow a multitude to do evil; neither shalt thou speak in a cause to decline after many to wrest judgment.",
    "topic": "peer_pressure",
    "moral": "Do not let peer pressure or popular opinion lead you into wrongdoing. Choose intrgrity over acceptance.",
    "reflectionQ": "When have you let the crowd direct you away from conviction?",
    "challenge": "Practice a one-sentence ‘no’ you’ll use when pressured.",
    "crossRefs": ["Proverbs 1:10", "Galatians 1:10"],
    "length": "single"
  },
  {
    "ref": "Deuteronomy 30:19-20",
    "translation": "KJV",
    "passage": "I call heaven and earth to record this day against you, that I have set before you life and death, blessing and cursing: therefore choose life, that both thou and thy seed may live: That thou mayest love the LORD thy God, and that thou mayest cleave unto him: for he is thy life, and the length of thy days: that thou mayest dwell in the land which the Lord sware unto thy fathers, to Abraham, to Isaac and to Jacob, to give them.",
    "topic": "choices",
    "moral": "God gives everybone free will; the power to choose between good and evil, life and death. The right choice leads to blessing. Choose life-giving paths on purpose.",
    "reflectionQ": "What ‘choose life’ decision is in front of you right now?",
    "challenge": "List three life-giving practices; commit to them for 7 days.",
    "crossRefs": ["Joshua 24:15", "Psalm 1:1-3"],
    "length": "multi"
  },
  {
    "ref": "Joshua 24:15",
    "translation": "KJV",
    "passage": "And if it seem evil unto you to serve the LORD, choose you this day whom ye will serve; whether the goods which thy fathers served that were on the other side of the flood, or the gods of the Amorites, in whose land ye dwell: but as for me and my house, we will serve the LORD.",
    "topic": "allegiance",
    "moral": "Serving God is not a one-time decision but a lifelong commitment that requires faithfulness in every circumstance.",
    "reflectionQ": "How will your schedule show whom you serve this week?",
    "challenge": "Post or write your ‘as for me’ commitment and live it for 5 days.",
    "crossRefs": ["Matthew 6:24", "Romans 12:1"],
    "length": "single"
  },
  {
    "ref": "1 Samuel 16:7",
    "translation": "KJV",
    "passage": "But the LORD said unto Samuel, look not on his countenance, or on the height of his stature; because i have refused him: for the LORD seeth not as man seeth; for man looketh on the outward appearance, but the LORD looketh on the heart.",
    "topic": "identity_heart",
    "moral": "Outward qualities may impress people, but integrity and a godly heart earn God's favor.",
    "reflectionQ": "What heart-work do you avoid while polishing your image?",
    "challenge": "Do one righteous act no one sees—on purpose.",
    "crossRefs": ["Matthew 6:1-4", "Proverbs 4:23"],
    "length": "single"
  },
  {
    "ref": "2 Samuel 24:24",
    "translation": "KJV",
    "passage": "And the king said unto Araunah, Nay: but i will surely buy it of thee at a price: neither will I offer burnt offerings unto the LORD my God of that which doth cost me nothing. So David bought the threshingfloor and the oxen for fifty shekels of silver.",
    "topic": "sacrifice",
    "moral": "Worship that costs nothing changes nothing. Genuine devotion is about giving from the heart, even when it costs something.",
    "reflectionQ": "Where should your worship cost you time, comfort, or resources?",
    "challenge": "Give up one comfort this week to serve someone sacrificially.",
    "crossRefs": ["Romans 12:1-2", "Luke 9:23"],
    "length": "single"
  },
  {
    "ref": "1 Kings 19:12-13",
    "translation": "KJV",
    "passage": "And after the earthquake a fire; but the LORD was in the fire: and after the fire a still small voice. And it was so, when Elijah heard it, that he wrapped his face in his mantle, and went out, and stood in the entering in of the cave. And, behold, there came a voice unto him, and said, what doest thou here, Elijah?",
    "topic": "discernment",
    "moral": "God often leads in quiet clarity, not loud chaos. Silence and reflection help us to recognize God's gentle guidance.",
    "reflectionQ": "What noise do you need to silence to hear God?",
    "challenge": "Take a 15-minute silence block (no phone) and journal what you sense.",
    "crossRefs": ["Psalm 46:10", "John 10:27"],
    "length": "multi"
  },
  {
    "ref": "Nehemiah 2:4-5",
    "translation": "KJV",
    "passage": "Then the king said unto me, For what dost thou make request? So I prayed to the God of heaven. And I said unto the king, If it please the king, and if thy servant have found favour in thy sight, that thou wouldest send me unto Judah, unto the city of the fathers' sepulchres, that i may build it.",
    "topic": "prayer_action",
    "moral": "Shoot a prayer, then take the step. When we trust and pray sincerely, God can move the hearts of people.",
    "reflectionQ": "Where do you need a ‘pray-then-ask’ boldness?",
    "challenge": "Before a hard conversation, pray a sentence prayer and act.",
    "crossRefs": ["James 1:5", "Colossians 4:5-6"],
    "length": "multi"
  },
  {
    "ref": "Job 23:10",
    "translation": "KJV",
    "passage": "But he knoweth the way that I take: when he hath tried me, I shall come forth as gold.",
    "topic": "refining",
    "moral": "God tests to refine, not to ruin. God sees and cares for us, even in life's hardest moments.",
    "reflectionQ": "What character is God refining through your current pressure?",
    "challenge": "Write three ‘refining gains’ you pray to see in this trial.",
    "crossRefs": ["1 Peter 1:6-7", "Romans 5:3-5"],
    "length": "single"
  },
  {
    "ref": "Psalm 51:17",
    "translation": "KJV",
    "passage": "The sacrifices of God are a broken spirit: a broken and a contrite heart, O God, thou wilt not despise.",
    "topic": "repentance",
    "moral": "God welcomes humbled hearts. No matter how far we've strayed, a contrite spirit is never despised by God.",
    "reflectionQ": "Where do you need contrition, not defense?",
    "challenge": "Pray Psalm 51 and confess one sin specifically to God today.",
    "crossRefs": ["1 John 1:9", "James 5:16"],
    "length": "single"
  },
  {
    "ref": "Psalm 119:32",
    "translation": "KJV",
    "passage": "I will run the way of thy commandments, when thou shalt enlarge my heart.",
    "topic": "obedience_delight",
    "moral": "Obedience should not be out of fear alone, but from love and joy in God's guidance.",
    "reflectionQ": "What would ‘enlarged heart’ obedience look like this week?",
    "challenge": "Ask God for delight, then obey one hard command today.",
    "crossRefs": ["Psalm 119:11", "John 14:21"],
    "length": "single"
  },
  {
    "ref": "Proverbs 3:3-4",
    "translation": "KJV",
    "passage": "Let not mercy and truth forsake thee: bind them anout thy neck; write them upon the table of thine heart: So shalt thou find favour and good understanding in the sight of God and man.",
    "topic": "character_balance",
    "moral": "Tie mercy and truth to your life—together they form Christlike strength.",
    "reflectionQ": "Are you softer than truth or harder than mercy?",
    "challenge": "Practice one ‘mercy+truth’ conversation today.",
    "crossRefs": ["John 1:14", "Ephesians 4:15"],
    "length": "multi"
  },
  {
    "ref": "Proverbs 11:14",
    "translation": "KJV",
    "passage": "Where no counsel is, the people fall: but in the multitude of counsellors there is safety.",
    "topic": "mentorship",
    "moral": "Recognizing that we don't have all the answers shows wisdom and prevents unnecessary pitfalls.",
    "reflectionQ": "Who are your top three counselors right now?",
    "challenge": "Run your next big decision by two mature believers.",
    "crossRefs": ["Proverbs 15:22", "Hebrews 13:17"],
    "length": "single"
  },
  {
    "ref": "Proverbs 14:23",
    "translation": "KJV",
    "passage": "In all labour there is profit: but the talk of the lips tendeth only to penury.",
    "topic": "diligence",
    "moral": "Plans and ideas without action have no value; talking alone cannot replace effort.",
    "reflectionQ": "Where are you talking more than working?",
    "challenge": "Do a focused 50-minute deep-work block today—no phone.",
    "crossRefs": ["Colossians 3:23", "Proverbs 22:29"],
    "length": "single"
  },
  {
    "ref": "Proverbs 16:9",
    "translation": "KJV",
    "passage": "A man's heart deviseth his way: but the LORD directeth his steps.",
    "topic": "guidance",
    "moral": "Making plans is good, but we must rely on God to guide the outcome. Plan diligently, trust humbly.",
    "reflectionQ": "Where do you need peace to hold plans loosely?",
    "challenge": "Pray ‘Lord, direct my steps’ before each plan today.",
    "crossRefs": ["James 4:15", "Psalm 37:23"],
    "length": "single"
  },
  {
    "ref": "Proverbs 18:1",
    "translation": "KJV",
    "passage": "Through desire a man, having separated himself, seeketh and intermeddleth with all wisdom.",
    "topic": "isolation_pride",
    "moral": "Unhealthy isolation feeds self-will and foolish choices.",
    "reflectionQ": "Are you withdrawing from wise community right now?",
    "challenge": "Initiate one honest check-in with a mentor/friend today.",
    "crossRefs": ["Hebrews 10:24-25", "Proverbs 27:17"],
    "length": "single"
  },
  {
    "ref": "Proverbs 20:1",
    "translation": "KJV",
    "passage": "Wine is a mocker, strong drink is raging: and whosoever is deceived thereby is not wise.",
    "topic": "sobriety",
    "moral": "Substances promise fun and deliver foolishness. Wisdom stays sober.",
    "reflectionQ": "What pressures tempt you toward numbing instead of praying?",
    "challenge": "Commit in writing to sobriety before God and share with accountability.",
    "crossRefs": ["Ephesians 5:18", "1 Peter 5:8"],
    "length": "single"
  },
  {
    "ref": "Proverbs 22:29",
    "translation": "KJV",
    "passage": "Seest thou a man diligent in his business? he shall stand before kings; he shall not stand before mean men",
    "topic": "excellence",
    "moral": "Doing your best in any task earns respect from others, even those in high positions. Excellence is evangelism at work.",
    "reflectionQ": "What skill will you sharpen this month for God’s glory?",
    "challenge": "Schedule five 30-minute practice sessions this week.",
    "crossRefs": ["Daniel 6:3", "Colossians 3:23"],
    "length": "single"
  },
  {
    "ref": "Proverbs 23:26-28",
    "translation": "KJV",
    "passage": "My son, give me thine heart, and let thine eyes observe my ways. For a whore is deep ditch; and a strange woman is a narrow pit. She also lieth in wait as for a prey, and increaseth the transgressors among men.",
    "topic": "sexual_boundaries",
    "moral": "Give your heart to God to guard your body in the world. Guard your eyes, mind, and heart against influences that lead to sin.",
    "reflectionQ": "Which boundary keeps your heart safest online and offline?",
    "challenge": "Set/strengthen one dating or device boundary today.",
    "crossRefs": ["Matthew 5:28", "2 Timothy 2:22"],
    "length": "multi"
  },
  {
    "ref": "Proverbs 25:28",
    "translation": "KJV",
    "passage": "He that hath no rule over his own spirit is like a city that is broken down, and without walls.",
    "topic": "self_control",
    "moral": "Self-control is protection, Without it, anything gets in.",
    "reflectionQ": "Where are your walls broken (anger, appetite, attention)?",
    "challenge": "Choose one ‘wall’ to rebuild with a clear daily rule.",
    "crossRefs": ["Galatians 5:22-23", "Titus 2:12"],
    "length": "single"
  },
  {
    "ref": "Ecclesiastes 4:9-12",
    "translation": "KJV",
    "passage": "Two are better than one; because they have a good reward for their labour. For if they fall, the one will lift up his fellow: but woe to him that is alone when he falleth; for he hath not another to help him up. Again, if two lie together, then have heat: but how can one be warm alone? And if one prevail against him, two shall withstand him; a threefold cord is not quickly broken.",
    "topic": "community_strength",
    "moral": "Strong faith is braided with friends and mentors. True friends or partners lift each other during challenges and provide strength",
    "reflectionQ": "Who are the two people who lift you when you fall?",
    "challenge": "Form a 3-person prayer/text chain for mutual support.",
    "crossRefs": ["Hebrews 10:24-25", "Proverbs 27:17"],
    "length": "multi"
  },
  {
    "ref": "Isaiah 1:18",
    "translation": "KJV",
    "passage": "Come now, and let us reason together, saith the LORD: though your sins be as scarlet, they shall be as white as snow; though they be red like crimson, they shall be as wool.",
    "topic": "grace_reason",
    "moral": "God invites honest minds and repentant hearts. No matter the depth of wrongdoing, genuine repentance leads to cleansing and restoration.",
    "reflectionQ": "What sin feels too ‘scarlet’ for you to bring to God?",
    "challenge": "Write a confession letter to God; read it to Him in prayer.",
    "crossRefs": ["1 John 1:9", "Psalm 51:7"],
    "length": "single"
  },
  {
    "ref": "Isaiah 6:8",
    "translation": "KJV",
    "passage": "Also heard the voice of the LORD, saying, whom shall I send, and who will go for us? Then said I, Here am I; send me.",
    "topic": "mission_call",
    "moral": "When God calls, respond with readiness and openness, even if the task is challenging.",
    "reflectionQ": "Where might God be sending you in your school or city?",
    "challenge": "Say ‘Here am I’ in prayer and volunteer for one kingdom task.",
    "crossRefs": ["Matthew 28:19-20", "Acts 1:8"],
    "length": "single"
  },
  {
    "ref": "Isaiah 43:2",
    "translation": "KJV",
    "passage": "When thou passest through the waters, I will be with thee; and through the rivers, they shall not overflow thee: when thou walkest through the fire, thou shalt not be burned; neither shall the flame kindle upon thee.",
    "topic": "presence_in_trial",
    "moral": "God doesn’t always remove the waters; He walks you through them. We are never alone in challenges; God's presence is constant and powerful.",
    "reflectionQ": "Where do you need to remember ‘I will be with thee’?",
    "challenge": "Memorize this verse and pray it in your hardest moment today.",
    "crossRefs": ["Hebrews 13:5", "Psalm 23:4"],
    "length": "single"
  },
  {
    "ref": "Isaiah 58:6-7",
    "translation": "KJV",
    "passage": "Is not this the fast that I have chosen? to loose the bands of wickedness, to undo the heavy burdens, and to let the oppressed go free, and that ye break every yoke? Is it not to deal thy bread to the hungry, and that thou bring the poor that are cast out to thy house? When thou seest the naked, that thou cover him; and that thou hide not thyself from thine own flesh?",
    "topic": "justice_fast",
    "moral": "Don't ignore the needs of those around you, stand against injustice and support those who are suffering or marginalized.",
    "reflectionQ": "How could your devotion lift someone’s burden this week?",
    "challenge": "Fast one meal and use the time/cost to serve or give.",
    "crossRefs": ["Micah 6:8", "Matthew 6:16-18"],
    "length": "multi"
  },
  {
    "ref": "Jeremiah 17:7-8",
    "translation": "KJV",
    "passage": "Blessed is the man that trusteth in the LORD, and whose hope the LORD is. For he shall be as a tree planted by the waters, and that spreadeth out her roots by the river, and shall not see when heat cometh, but her leaf shall be green; and shall not be careful in the year of drought, neither shall cease from yielding fruit.",
    "topic": "trust_roots",
    "moral": "Relying on God rather than solely on human effort ensures lasting peace and success.",
    "reflectionQ": "What practice is deepening your roots in God?",
    "challenge": "Schedule two 15-minute root times (Word + prayer) this week.",
    "crossRefs": ["Psalm 1:3", "Colossians 2:6-7"],
    "length": "multi"
  },
  {
    "ref": "Lamentations 3:27",
    "translation": "KJV",
    "passage": "It is good for a man that he bear the yoke in his youth.",
    "topic": "early_discipline",
    "moral": "Early discipline builds lifelong strength. Learning self-control, responsibility, and moral lessons early builds a strong foundation.",
    "reflectionQ": "What yoke (habit) will you bear for future faithfulness?",
    "challenge": "Commit to a 30-day habit (Scripture, prayer, study); track daily.",
    "crossRefs": ["1 Corinthians 9:27", "Hebrews 12:11"],
    "length": "single"
  },
  {
    "ref": "Ezekiel 36:26",
    "translation": "KJV",
    "passage": "A new heart also will I give you, and a new spirit will I put within you: and I will take away the stony heart out of your flesh, and I will give you an heart of flesh.",
    "topic": "new_heart",
    "moral": "No matter how resistant or hardened we may be, God can renew and soften us to His guidance.",
    "reflectionQ": "Where do you need God to change desire, not just behavior?",
    "challenge": "Ask God for a new-heart desire in one stubborn area; share with a mentor.",
    "crossRefs": ["2 Corinthians 5:17", "Philippians 2:13"],
    "length": "single"
  },
  {
    "ref": "Daniel 12:3",
    "translation": "KJV",
    "passage": "And they that be wise shall shine as the brightness of the firmament; and they that turn many to righteousness as the stars for ever and ever.",
    "topic": "evangelism_reward",
    "moral": "Helping others choose righteousness magnifies one's impact in the world.",
    "reflectionQ": "Who are your top two to pray for and pursue?",
    "challenge": "Share a clear gospel snippet with one friend this week.",
    "crossRefs": ["Matthew 5:16", "1 Peter 3:15"],
    "length": "single"
  },
  {
    "ref": "Hosea 10:12",
    "translation": "KJV",
    "passage": "Sow to yourselves in righteousness, reap in mercy; break up your fallow ground: for it is time to seek the LORD, till he come and rain righteousness upon you.",
    "topic": "seek_and_sow",
    "moral": "True seeking of God leads to His guidance, mercy, and spiritual nourishment. Start sowing now.",
    "reflectionQ": "What righteous seed will you plant today?",
    "challenge": "Do one hidden act of obedience as today’s seed.",
    "crossRefs": ["Galatians 6:7-9", "Psalm 126:5"],
    "length": "single"
  },
  {
    "ref": "Micah 7:8",
    "translation": "KJV",
    "passage": "Rejoice not against me, O mine enemy: when I fall, I shall arise; when i sit in darkness, the LORD shall be a light unto me.",
    "topic": "resilience",
    "moral": "Even in times of confusion, pain, or uncertainty, God's presence illuminates the path.",
    "reflectionQ": "Where do you need a Spirit-powered ‘get up’?",
    "challenge": "Make one amends and one new plan after a failure.",
    "crossRefs": ["Proverbs 24:16", "Psalm 37:24"],
    "length": "single"
  },
  {
    "ref": "Habakkuk 3:17-19",
    "translation": "KJV",
    "passage": "Although the fig tree shall not blossom, neither shall fruit be in the vines; the labour of the olive shall fail, and the fields shall yield no meat; the flock shall be cut off from the fold, and there shall be no herd in the stalls: yet I will rejoice in the LORD, I will joy in the God of my salvation. The LORD God is my strength, and he will make my feet like hinds' feet, and he will make me to walk upon mine high place. To the chief singer on my stringed instruments.",
    "topic": "joy_in_lack",
    "moral": "Our happiness should not depend on material prosperity but on our relationship with God.",
    "reflectionQ": "Where could you rejoice in God without visible results?",
    "challenge": "Write a ‘yet I will rejoice’ prayer about one lack.",
    "crossRefs": ["Philippians 4:4", "Psalm 73:25-26"],
    "length": "multi"
  },
  {
    "ref": "Matthew 13:44-46",
    "translation": "KJV",
    "passage": "Again, the kingdom of heaven is like unto treasure hid in a field; the which when a man hath found, he hideth, and for joy thereof goeth and selleth all that he hath, and buyeth that field. Again, the kingdom of heaven is like unto a merchant seeking goodly pearls: who, when he had found one pearl of great price, went and sold all that he had, and bought it.",
    "topic": "kingdom_value",
    "moral": "Jesus is worth the trade of all lesser treasures. If God's kingdom truly is our greatest treasure, our choices, time, and resources should reflect that priority.",
    "reflectionQ": "What would you ‘sell’ to gain more of Christ?",
    "challenge": "Trade 60 minutes of entertainment for Scripture and prayer tonight.",
    "crossRefs": ["Philippians 3:8", "Matthew 6:33"],
    "length": "multi"
  },
  {
    "ref": "Matthew 24:12-13",
    "translation": "KJV",
    "passage": "And because iniquity shall abound, the love of many shall wax cold. But he that shall endure unto the end, the same shall be saved.",
    "topic": "endurance_love",
    "moral": "Enduring through hardship reveals a heart that truly trusts in God's promises. True faith is not about starting strong but about finishing faithfully.",
    "reflectionQ": "What cools your love for God and people?",
    "challenge": "Rekindle with a 3×10: praise, prayer, people—10 minutes each.",
    "crossRefs": ["Jude 1:20-21", "Hebrews 10:23"],
    "length": "multi"
  },
  {
    "ref": "Luke 9:62",
    "translation": "KJV",
    "passage": "And Jesus said unto him, No man, having put his hand to the plough, and looking back, is fit for the kingdom of God.",
    "topic": "resolve",
    "moral": "Folling Christ requires total dedication. Once we decide to serve God, we must not look back or be divided in our loyalty.",
    "reflectionQ": "Where are you tempted to look back instead of press on?",
    "challenge": "Remove one backward-looking habit for 7 days.",
    "crossRefs": ["Philippians 3:13-14", "Hebrews 12:1"],
    "length": "single"
  },
  {
    "ref": "Luke 12:2-3",
    "translation": "KJV",
    "passage": "For there is nothing covered, that shall not be revealed; neither hid, that shall not be known. Therefore whatsoever ye have spoken in darkness shall be heard in the light; and that which ye have spoken in the ear in closets shall be proclaimed upon the housetops.",
    "topic": "secrecy_integrity",
    "moral": "Nothing is hidden from God's eyes. Every secret thought, word, and deed will one day be revealed, therefore, we should live hoenstly and transparently before God and others.",
    "reflectionQ": "What private habit needs light now—not later?",
    "challenge": "Tell one hidden struggle to a trusted believer today.",
    "crossRefs": ["1 John 1:7-9", "Proverbs 28:13"],
    "length": "single"
  },
  {
    "ref": "Luke 22:42",
    "translation": "KJV",
    "passage": "Saying, Father, if thou be willing, revome this cup from me: nevertheless not my will, but thine, be done.",
    "topic": "surrender",
    "moral": "True faith means trusting God's plan above our own desires.",
    "reflectionQ": "Where do you need to bow your will to the Father?",
    "challenge": "Pray this line slowly over one decision and accept His way.",
    "crossRefs": ["Romans 12:2", "James 4:7"],
    "length": "single"
  },
  {
    "ref": "John 3:30",
    "translation": "KJV",
    "passage": "He must increase, but I must decrease.",
    "topic": "humility_focus",
    "moral": "Spiritual growth begins when we surrender our ego to God.",
    "reflectionQ": "What platform or preference needs to decrease so Christ can increase?",
    "challenge": "Do one good work anonymously this week.",
    "crossRefs": ["Galatians 2:20", "Philippians 2:3-4"],
    "length": "single"
  },
  {
    "ref": "John 4:23-24",
    "translation": "KJV",
    "passage": "But the hour cometh, and now is, when the true worshippers shall worship the Father in spirit and in truth: for the Father seeketh such to worship him. God is a Spirit: and they that worship him must worship him, in spirit and in truth.",
    "topic": "worship",
    "moral": "God seeks worship that is both sincere and Scriptural. Real worship flows from a heart that loves and honors Him.",
    "reflectionQ": "Is your worship strong in truth but weak in spirit, or the reverse?",
    "challenge": "Prepare your heart with Scripture before your next worship time.",
    "crossRefs": ["Psalm 51:6", "Colossians 3:16"],
    "length": "multi"
  },
  {
    "ref": "John 6:68",
    "translation": "KJV",
    "passage": "Then Simon Peter answered him, Lord, to whom shall we go? thou hast the words of eternal life.",
    "topic": "loyalty_to_Christ",
    "moral": "True faith requires commitment, especially when following Jesus is challenging.",
    "reflectionQ": "What disappointment tempts you to walk away from Jesus?",
    "challenge": "Tell Jesus in prayer why you’re staying with Him today.",
    "crossRefs": ["Hebrews 12:2-3", "John 15:5"],
    "length": "single"
  },
  {
    "ref": "John 12:24-26",
    "translation": "KJV",
    "passage": "Verily, verily, I say unto you, except a corn of wheat fall into the ground and die, it abideth alone: but if it die, it bringrth forth much fruit. He that loveth his life shall lose it; and he that hateth his life in this world shall keep it unto life eternal. If any man serve me, let him follow me; and where I am, there shall also my servant be: if any man serve me, him will my Father honour.",
    "topic": "death_to_self",
    "moral": "True discipleship involves prioritizing God over comfort, status, or convenience.",
    "reflectionQ": "What must ‘die’ in you for more fruit to grow?",
    "challenge": "Fast one comfort and use the time to serve someone.",
    "crossRefs": ["Luke 9:23", "Galatians 5:24"],
    "length": "multi"
  },
  {
    "ref": "John 17:15-18",
    "translation": "KJV",
    "passage": "I pray not that thou shouldest take them out of the world, but that thou shouldest keep them from the evil. They are not the world, even as i am not of the world. Sanctify them through thy truth: thy word is truth. As thou hast sent me into the world, even so have i also sent them into the world.",
    "topic": "in_but_not_of",
    "moral": "We are called to remain in society without being corrupted by worldly sin.",
    "reflectionQ": "What boundary keeps you distinct while you engage?",
    "challenge": "Define one ‘in-not-of’ practice for your online life.",
    "crossRefs": ["Romans 12:2", "Colossians 4:5-6"],
    "length": "multi"
  },
  {
    "ref": "Acts 5:29",
    "translation": "KJV",
    "passage": "Then Peter and the other apostles answered and said, We ought to obey God rather than men.",
    "topic": "courage_conviction",
    "moral": "Upholding God's commandments is essential, even when it is inconvenient or unpopular.",
    "reflectionQ": "Where might obedience cost you popularity?",
    "challenge": "Write your conviction in one sentence and live it this week.",
    "crossRefs": ["Daniel 3:18", "Matthew 10:32-33"],
    "length": "single"
  },
  {
    "ref": "Romans 6:12-14",
    "translation": "KJV",
    "passage": "Let not sin therefore reign in your mortal body, that ye should obey it in the lusts thereof. Neither yield ye your members as instruments of unrighteousness unto sin: but yield yourselves unto God, as those that are alive from the dead, and members as instruments of righteousness unto God. For sin shall not have dominion over you: for ye are not under the law, but under grace.",
    "topic": "freedom_from_sin",
    "moral": "Sin should not dominate our actions or desires. We are called to resist temptation and refuse to allow sinful habits to dicate our lives.",
    "reflectionQ": "Which area tries to reclaim dominion in your life?",
    "challenge": "When tempted, confess this verse aloud and take the escape route.",
    "crossRefs": ["Romans 8:13", "Galatians 5:16"],
    "length": "multi"
  },
  {
    "ref": "Romans 12:9-13",
    "translation": "KJV",
    "passage": "Let love be without dissimulation. Abhor that which is evil; cleave to that which is good. Be kindly affectioned one to another with brotherly love; in honour preferring one another; not slothful in business; fervent in spirit; serving the Lord; rejoicing in hope; patient in tribulation; continuing instant in prayer; distributing to the necessity of saints; given to hospitality.",
    "topic": "marks_of_love",
    "moral": "Love should be genuine and without hypocristy. .",
    "reflectionQ": "Which mark here needs revival in you?",
    "challenge": "Pick two marks and practice them intentionally today.",
    "crossRefs": ["John 13:34-35", "Galatians 6:10"],
    "length": "multi"
  },
  {
    "ref": "2 Corinthians 4:16-18",
    "translation": "KJV",
    "passage": "For which cause we faint not; buth though our outward man perish, yet the inward man is renewed day by day. For our light affliction, which is but for a moment, worketh for us a far more exceeding and eternal weight of glory; While we look not at the things which are not seen: for the things which are seen are temporal; but the things which are not seen are eternal.",
    "topic": "eternal_perspective",
    "moral": "Difficulties are temporary and purposeful. They are 'light afflictions' that produce eternal benefits if endured with faith.",
    "reflectionQ": "How would your response change if you believed this deeply?",
    "challenge": "Write a ‘then vs. now’ list: eternal promises vs present pain.",
    "crossRefs": ["Romans 8:18", "1 Peter 5:10"],
    "length": "multi"
  },
  {
    "ref": "2 Corinthians 6:14",
    "translation": "KJV",
    "passage": "Be ye not unequally yoked together with unbelievers: for what fellowship hath righteousness with unrighteousness? And what communion hath light with darkness?",
    "topic": "relationships_yoke",
    "moral": "Believers are cautioned against forming binding partnerships with those who do not share their faith, as conflicting values can lead to compromise and moral conflict.",
    "reflectionQ": "What close tie is pulling you off God’s path?",
    "challenge": "Set a wise boundary or have a clarifying talk about shared values.",
    "crossRefs": ["Amos 3:3", "Proverbs 13:20"],
    "length": "single"
  },
  {
    "ref": "2 Corinthians 7:1",
    "translation": "KJV",
    "passage": "Having therefore these promises, dearly beloved, let us cleanse ourselves from all filthiness of the flesh and spirit, perfecting holiness in the fear of God.",
    "topic": "holiness",
    "moral": "Holiness involves cleansing oneself from sin in every aspect of life.",
    "reflectionQ": "What ‘filthiness’ clings to your habits or motives?",
    "challenge": "Identify one cleanse step (delete, confess, replace) and do it today.",
    "crossRefs": ["1 Thessalonians 4:3-7", "Hebrews 12:14"],
    "length": "single"
  }
]
